app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password`, `first`, `last`, `created_at`, `updated_at`) VALUES ('asdf', '1234', 'testFirst', 'testLast', '2017-02-28 01:31:42', '2017-02-28 01:31:42')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `username` = 'titosdfg' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)